import java.util.Scanner;

public class Dz15 {
    //Необходимо вывести на экран таблицу умножения на 3:
//    public static void main(String[] args) {
//        for (int a = 1; a <= 10; a++)
//            System.out.println("3 * " + a + " = " + 3 * a);
//    }}

/* Необходимо вывести на экран числа от 5 до 1. На экране должно быть:
        5 4 3 2 1 */
//
//    public static void main(String[] args) {
//        for (int a = 5; a >= 1; a--) {
//            System.out.print(a + " ");
//        }}}

//      Необходимо написать программу, где бы пользователю предлагалось ввести число на выбор:
//      1, 2 или 3, а программа должна сказать, какое число ввёл пользователь: 1, 2, или 3.
//      Cпособ If:

//        public static void main (String [] args) {
//
//            System.out.print ("Введите число 1, 2 или 3: ");
//            Scanner inputFigure = new Scanner (System.in);
//            int i = inputFigure.nextInt ();
//            if ( i==1) {
//                System.out.println ("Вы ввели число 1");
//            }
//            else if (i==2) {
//                System.out.println ("Вы ввели число 2");
//            }
//            else if (i==3) {
//                System.out.println ("Вы ввели число 3");
//            }
//            else {
//                System.out.println ("Вы ввели число не равное 1, 2 или 3");
//            }
//        }}

//Необходимо написать программу, где бы пользователю предлагалось ввести число на выбор:
////      1, 2 или 3, а программа должна сказать, какое число ввёл пользователь: 1, 2, или 3.
////      Cпособ switch:

//    public static void main(String args[]){
//        System.out.println("Введите 1, 2, или 3:");
//        Scanner scan = new Scanner(System.in);
//        int number = scan.nextInt();
//
//        switch (number){
//            case 1: System.out.println ("Вы ввели число 1"); break;
//            case 2: System.out.println ("Вы ввели число 2"); break;
//            case 3: System.out.println ("Вы ввели число 3"); break;
//            default: System.out.println("Вы ввели неправильное число");
//        }
//    }}



//        public static void main(String[] args){
//            double sum = 0;
//            for (int a = 1; a <= 100; a++) {
//                sum = sum + a;
//            }
//            System.out.println("Среднее арифметическое чисел составляет:"+(sum / 100));
//        }}

